#+Title: Domain Analysis for My Application
TODO set this variable to t: org-src-preserve-indentation

This is an app for organizing my workout routine. The end goal is to
have a mobile app that:

- Keeps track of my exercises (# reps, sets, ...)
- Predicts what exercise I will do next based on known policies

* Workout Routine

This is an app for workout routines. A workout is a sequence of
exercises. Each exercise has a name, a number of sets and reps.

#+begin_src fsharp :tangle "Domain.fs"
  module Workout =

      type RepCount = int

      type ExerciseWeightLevel =
          | OneRM
          | ThreeRM
          | FiveRM
          | EightRM

      type WeightValue =
          | Kilogram of double
          | Pounds of double

      type Exercise = {
          Name: string
          Description: string
          VideoTutorial: string option
      }

      type Comment = string

      type ExerciseSetState =
          | NotTried
          | Completed
          | Failed of Comment option

      type ExerciseSet = {
          Reps: RepCount
          TargetWeight: WeightValue
          WeightLevel: WeightLevel
          Status: ExerciseSetState
      }

      // Example: 3 sets: 5 reps of 5RM, 4 reps of 3RM, 1 rep of 1RM
      type ExerciseSetup = {
          Exercise: Exercise
          Sets: ExerciseSet list
          Comment: Comment option
      }

      // The workout to be done on a given day
      type WorkoutSession = {
          Routine: ExerciseSetup list
          DateTime: DateTime
          Comment: Comment option
      }

      type UserWorkoutHistory = WorkoutSession list

      type WorkoutSplit =
          | PushPull
          | Custom of Exercise list list

      type Cycle =
          | Weekly of int // number of day a week
          | RoundRobin of int // number of days in cycle

      type ExercisePolicy =
          | ThreeOfFive
          | FiveThreeOneSingleSetCycle
          | ThreeOfEight
          | Custom of (ExerciseWeightLevel * RepCount) list

      type WorkoutPlan = {
          CycleType: Cycle
          Exercises: (Exercise * ExercisePolicy) list
      }
#+end_src

#+RESULTS:
: WeightLevel: WeightLevel
:   ---------------------^^^^^^^^^^^
:
: /home/jz/SideProjects/sharp-my-giraffe/HelloWorldHttpAPI/stdin(31,22): error FS0039: The type 'WeightLevel' is not defined. Maybe you want one of the following:
:    WeightValue

